# GetTileOffsetPoint

## Description
Gets the specified tile resource's offset point.

```pascal
PROCEDURE GetTileOffsetPoint(
				tileHandle      : HANDLE;
				VAR offsetPoint : REAL);
```

```python

def vs.GetTileOffsetPoint(tileHandle):
    return offsetPoint
```

## Parameters
|Name|Type|Description|
|---|---|---|
|tileHandle|HANDLE|The tile resource from which to get the offset point.|
|offsetPoint|REAL|The retrieved offset point.|

## Examples
```pascal
GetTileOffsetPoint(tileHandle, offsetPoint);
```

## See Also
VS Functions:
CreateTile| ShowEditTileDialog| ShowEditTileSettingsDialog| ShowNewTileDialog| GetTileGeometryGroup| BeginGroupN| AddTileGeometryObject| GetTileGroupParent| IsTileGroupContainedObject| GetTileBackgroundColor| SetTileBackgroundColor| GetTileRepetitionPoint| SetTileRepetitionPoint| GetTileOffsetPoint| SetTileOffsetPoint

## Version
Availability: from Vectorworks 2011
## Category
* Document Attributes